Project/Toir/src/Enums/торо_СтатусыДокументов/торо_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_СтатусыДокументов</name>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
  <enumValues>
    <name>ЗапланированоУстранение</name>
  </enumValues>
  <enumValues>
    <name>Устраняется</name>
  </enumValues>
  <enumValues>
    <name>Устранен</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ОтказИсполнителя</name>
  </enumValues>
  <enumValues>
    <name>ВозобновленоПослеОтказа</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>ОтказПодразделения</name>
  </enumValues>
  <enumValues>
    <name>гкс_ВыполненНеобходимАктПриемки</name>
  </enumValues>
  <enumValues>
    <name>гкс_Новый</name>
    <comment>TOIR20-673</comment>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/CommonModules/торо_ТестовыеЗадачи/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список открытых заявок на ремонт.
//
// Параметры:
//   ДатаНачала  - Дата - начало периода отбора по дате документа (включительно).
//   ДатаОкончания - Дата - окончание периода отбора по дате документа (включительно).
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с колонками: Ссылка, Дата, Ответственный, Статус.
//
Функция ПолучитьОткрытыеЗаявкиНаРемонт(ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Заявка.Ссылка          КАК Ссылка,
		|	Заявка.Дата            КАК Дата,
		|	Заявка.Ответственный   КАК Ответственный,
		|	Заявка.СтатусДокумента КАК Статус
		|ИЗ
		|	Документ.торо_ЗаявкаНаРемонт КАК Заявка
		|ГДЕ
		|	Заявка.СтатусДокумента НЕ В (&ЗакрытыеСтатусы)
		|	И НЕ Заявка.ПометкаУдаления
		|	И (&ДатаНачала   = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Заявка.Дата >= &ДатаНачала)
		|	И (&ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1) ИЛИ Заявка.Дата <= &ДатаОкончания)
		|УПОРЯДОЧИТЬ ПО
		|	Заявка.Дата УБЫВ";

	ЗакрытыеСтатусы = Новый Массив;
	ЗакрытыеСтатусы.Добавить(Перечисления.торо_СтатусыДокументов.Устранен);
	ЗакрытыеСтатусы.Добавить(Перечисления.торо_СтатусыДокументов.Отклонен);
	ЗакрытыеСтатусы.Добавить(Перечисления.торо_СтатусыДокументов.Выполнен);
	ЗакрытыеСтатусы.Добавить(Перечисления.торо_СтатусыДокументов.ОтказИсполнителя);
	ЗакрытыеСтатусы.Добавить(Перечисления.торо_СтатусыДокументов.ОтказПодразделения);

	Запрос.УстановитьПараметр("ЗакрытыеСтатусы",  ЗакрытыеСтатусы);
	Запрос.УстановитьПараметр("ДатаНачала",        ?(ДатаНачала    = Неопределено, '00010101', ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",     ?(ДатаОкончания = Неопределено, '00010101', ДатаОкончания));

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти
